{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "antelope",
    "1": "badger",
    "2": "bat",
    "3": "bear",
    "4": "bee",
    "5": "beetle",
    "6": "bison",
    "7": "boar",
    "8": "butterfly",
    "9": "cat",
    "10": "caterpillar",
    "11": "chimpanzee",
    "12": "cockroach",
    "13": "cow",
    "14": "coyote",
    "15": "crab",
    "16": "crow",
    "17": "deer",
    "18": "dog",
    "19": "dolphin",
    "20": "donkey",
    "21": "dragonfly",
    "22": "duck",
    "23": "eagle",
    "24": "elephant",
    "25": "flamingo",
    "26": "fly",
    "27": "fox",
    "28": "goat",
    "29": "goldfish",
    "30": "goose",
    "31": "gorilla",
    "32": "grasshopper",
    "33": "hamster",
    "34": "hare",
    "35": "hedgehog",
    "36": "hippopotamus",
    "37": "hornbill",
    "38": "horse",
    "39": "hummingbird",
    "40": "hyena",
    "41": "jellyfish",
    "42": "kangaroo",
    "43": "koala",
    "44": "ladybugs",
    "45": "leopard",
    "46": "lion",
    "47": "lizard",
    "48": "lobster",
    "49": "mosquito",
    "50": "moth",
    "51": "mouse",
    "52": "octopus",
    "53": "okapi",
    "54": "orangutan",
    "55": "otter",
    "56": "owl",
    "57": "ox",
    "58": "oyster",
    "59": "panda",
    "60": "parrot",
    "61": "pelecaniformes",
    "62": "penguin",
    "63": "pig",
    "64": "pigeon",
    "65": "porcupine",
    "66": "possum",
    "67": "raccoon",
    "68": "rat",
    "69": "reindeer",
    "70": "rhinoceros",
    "71": "sandpiper",
    "72": "seahorse",
    "73": "seal",
    "74": "shark",
    "75": "sheep",
    "76": "snake",
    "77": "sparrow",
    "78": "squid",
    "79": "squirrel",
    "80": "starfish",
    "81": "swan",
    "82": "tiger",
    "83": "turkey",
    "84": "turtle",
    "85": "whale",
    "86": "wolf",
    "87": "wombat",
    "88": "woodpecker",
    "89": "zebra"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "antelope": 0,
    "badger": 1,
    "bat": 2,
    "bear": 3,
    "bee": 4,
    "beetle": 5,
    "bison": 6,
    "boar": 7,
    "butterfly": 8,
    "cat": 9,
    "caterpillar": 10,
    "chimpanzee": 11,
    "cockroach": 12,
    "cow": 13,
    "coyote": 14,
    "crab": 15,
    "crow": 16,
    "deer": 17,
    "dog": 18,
    "dolphin": 19,
    "donkey": 20,
    "dragonfly": 21,
    "duck": 22,
    "eagle": 23,
    "elephant": 24,
    "flamingo": 25,
    "fly": 26,
    "fox": 27,
    "goat": 28,
    "goldfish": 29,
    "goose": 30,
    "gorilla": 31,
    "grasshopper": 32,
    "hamster": 33,
    "hare": 34,
    "hedgehog": 35,
    "hippopotamus": 36,
    "hornbill": 37,
    "horse": 38,
    "hummingbird": 39,
    "hyena": 40,
    "jellyfish": 41,
    "kangaroo": 42,
    "koala": 43,
    "ladybugs": 44,
    "leopard": 45,
    "lion": 46,
    "lizard": 47,
    "lobster": 48,
    "mosquito": 49,
    "moth": 50,
    "mouse": 51,
    "octopus": 52,
    "okapi": 53,
    "orangutan": 54,
    "otter": 55,
    "owl": 56,
    "ox": 57,
    "oyster": 58,
    "panda": 59,
    "parrot": 60,
    "pelecaniformes": 61,
    "penguin": 62,
    "pig": 63,
    "pigeon": 64,
    "porcupine": 65,
    "possum": 66,
    "raccoon": 67,
    "rat": 68,
    "reindeer": 69,
    "rhinoceros": 70,
    "sandpiper": 71,
    "seahorse": 72,
    "seal": 73,
    "shark": 74,
    "sheep": 75,
    "snake": 76,
    "sparrow": 77,
    "squid": 78,
    "squirrel": 79,
    "starfish": 80,
    "swan": 81,
    "tiger": 82,
    "turkey": 83,
    "turtle": 84,
    "whale": 85,
    "wolf": 86,
    "wombat": 87,
    "woodpecker": 88,
    "zebra": 89
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.56.0"
}
